## PANDAS DATAFRAMES

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [78]:
# imports
import numpy as np
import pandas as pd

In [79]:
from numpy.random import random, randn # numpy random numbers between 0 and 1

In [80]:
# create a dataframe
df = pd.DataFrame(random(20).reshape(5, 4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [11]:
df   # show

          W         X         Y         Z
A  0.237771  0.029479  0.921123  0.414029
B  0.148881  0.734014  0.105001  0.824356
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293
E  0.118812  0.302449  0.003767  0.956487

## Selection and Indexing

Let's practice the various methods to grab data from a DataFrame

#### Selecting Columns

In [12]:
df['W']  # select a single column

A    0.237771
B    0.148881
C    0.669889
D    0.408466
E    0.118812
Name: W, dtype: float64

In [14]:
df[['X', 'Z']] # select multiple by providing an array of column indexes

          X         Z
A  0.029479  0.414029
B  0.734014  0.824356
C  0.670316  0.041354
D  0.612496  0.234293
E  0.302449  0.956487

In [18]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.237771
B    0.148881
C    0.669889
D    0.408466
E    0.118812
Name: W, dtype: float64

**Dataframe Columns are just series**

In [19]:
type(df['X'])

pandas.core.series.Series

#### Creating a new column

In [20]:
df['new'] = df['W'] + df['Y']

In [22]:
df # show

          W         X         Y         Z       new
A  0.237771  0.029479  0.921123  0.414029  1.158894
B  0.148881  0.734014  0.105001  0.824356  0.253883
C  0.669889  0.670316  0.645962  0.041354  1.315851
D  0.408466  0.612496  0.324035  0.234293  0.732501
E  0.118812  0.302449  0.003767  0.956487  0.122579

#### Removing Columns

In [24]:
df.drop("new", axis=1)

          W         X         Y         Z
A  0.237771  0.029479  0.921123  0.414029
B  0.148881  0.734014  0.105001  0.824356
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293
E  0.118812  0.302449  0.003767  0.956487

In [26]:
# df.drop() does not delete inplace unless specified!
df

          W         X         Y         Z       new
A  0.237771  0.029479  0.921123  0.414029  1.158894
B  0.148881  0.734014  0.105001  0.824356  0.253883
C  0.669889  0.670316  0.645962  0.041354  1.315851
D  0.408466  0.612496  0.324035  0.234293  0.732501
E  0.118812  0.302449  0.003767  0.956487  0.122579

In [27]:
df.drop('new',axis=1,inplace=True) ## specify inplace attribute OR reassign the result to df

df  # show

          W         X         Y         Z
A  0.237771  0.029479  0.921123  0.414029
B  0.148881  0.734014  0.105001  0.824356
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293
E  0.118812  0.302449  0.003767  0.956487

**You can drop rows in a similar way, changing only the axis**

In [30]:
df.drop('A', axis=0) # also not inplace... I think you got that

          W         X         Y         Z
B  0.148881  0.734014  0.105001  0.824356
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293
E  0.118812  0.302449  0.003767  0.956487

#### Selecting Rows

In [34]:
df.loc['A']

W    0.237771
X    0.029479
Y    0.921123
Z    0.414029
Name: A, dtype: float64

**OR selct based on index using iloc**

In [35]:
df.iloc[3]

W    0.408466
X    0.612496
Y    0.324035
Z    0.234293
Name: D, dtype: float64

### Selecting subset of rows and columns

In [37]:
df.loc['B', 'Y']  # row B column Y

0.10500121537430185

In [39]:
df.loc[['C', 'D'],['X', 'Z']]  # multiple columns and/or rows

          X         Z
C  0.670316  0.041354
D  0.612496  0.234293

## **Conditional Selection**

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [41]:
# returns a dataframe of true or false values based on conditional satisfaction
df > 0.5

       W      X      Y      Z
A  False  False   True  False
B  False   True  False   True
C   True   True   True  False
D  False   True  False  False
E  False  False  False   True

In [43]:
df[df>0.5] # replaces false with NaN and true with actual value in place

          W         X         Y         Z
A       NaN       NaN  0.921123       NaN
B       NaN  0.734014       NaN  0.824356
C  0.669889  0.670316  0.645962       NaN
D       NaN  0.612496       NaN       NaN
E       NaN       NaN       NaN  0.956487

In [53]:
df[df['X'] > 0.5] # simmilar, only truthy is applied to just the column X
# NB:=> also got rid of rows with NaN values

          W         X         Y         Z
B  0.148881  0.734014  0.105001  0.824356
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293

In [47]:
df[df['Y'] > 0.5].loc['A'] # it returns a dataframe hence result shall support all dataframe methods

W    0.237771
X    0.029479
Y    0.921123
Z    0.414029
Name: A, dtype: float64

In [55]:
df[df['X'] > 0.5].loc[['C', 'B'], ['W', 'Z']]

          W         Z
C  0.669889  0.041354
B  0.148881  0.824356

In [56]:
df[df['Y'] < 0.7]['Z']

B    0.824356
C    0.041354
D    0.234293
E    0.956487
Name: Z, dtype: float64

### **For two conditions use the & and | with parenthesis**

In [63]:
df[(df['W'] > 0.5) | (df['Z'] < 0.5)]

          W         X         Y         Z
A  0.237771  0.029479  0.921123  0.414029
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [64]:
df

          W         X         Y         Z
A  0.237771  0.029479  0.921123  0.414029
B  0.148881  0.734014  0.105001  0.824356
C  0.669889  0.670316  0.645962  0.041354
D  0.408466  0.612496  0.324035  0.234293
E  0.118812  0.302449  0.003767  0.956487

In [65]:
df.reset_index() # set index back to original 0,1...n - (not in place)

  index         W         X         Y         Z
0     A  0.237771  0.029479  0.921123  0.414029
1     B  0.148881  0.734014  0.105001  0.824356
2     C  0.669889  0.670316  0.645962  0.041354
3     D  0.408466  0.612496  0.324035  0.234293
4     E  0.118812  0.302449  0.003767  0.956487

In [66]:
newInd = 'CA NY WY OR CO'.split()
df['States'] = newInd
df

          W         X         Y         Z States
A  0.237771  0.029479  0.921123  0.414029     CA
B  0.148881  0.734014  0.105001  0.824356     NY
C  0.669889  0.670316  0.645962  0.041354     WY
D  0.408466  0.612496  0.324035  0.234293     OR
E  0.118812  0.302449  0.003767  0.956487     CO

In [67]:
df.set_index('States') # make as index  (not in place)

               W         X         Y         Z
States
CA      0.237771  0.029479  0.921123  0.414029
NY      0.148881  0.734014  0.105001  0.824356
WY      0.669889  0.670316  0.645962  0.041354
OR      0.408466  0.612496  0.324035  0.234293
CO      0.118812  0.302449  0.003767  0.956487

In [68]:
df # NB:=> still not in place

          W         X         Y         Z States
A  0.237771  0.029479  0.921123  0.414029     CA
B  0.148881  0.734014  0.105001  0.824356     NY
C  0.669889  0.670316  0.645962  0.041354     WY
D  0.408466  0.612496  0.324035  0.234293     OR
E  0.118812  0.302449  0.003767  0.956487     CO

In [69]:
df.set_index('States', inplace=True)

In [70]:
df #=> done

               W         X         Y         Z
States
CA      0.237771  0.029479  0.921123  0.414029
NY      0.148881  0.734014  0.105001  0.824356
WY      0.669889  0.670316  0.645962  0.041354
OR      0.408466  0.612496  0.324035  0.234293
CO      0.118812  0.302449  0.003767  0.956487

## **Multi-Index and Index Hierarchy**

Let's practice how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [76]:
# index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 4, 5, 6]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [77]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 4),
            ('G2', 5),
            ('G2', 6)],
           )

In [81]:
df = pd.DataFrame(randn(6, 2), index=hier_index, columns='A B'.split())

In [82]:
df

             A         B
G1 1  0.675916  0.990436
   2  1.036234 -0.256323
   3  0.482995  1.253826
G2 4  0.716587 -1.116121
   5 -1.149636 -1.089989
   6 -0.623961  0.078738

**Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:**

In [83]:
df['A'] # selecting columns remains the same

G1  1    0.675916
    2    1.036234
    3    0.482995
G2  4    0.716587
    5   -1.149636
    6   -0.623961
Name: A, dtype: float64

In [84]:
df.loc['G1'] # row selection

          A         B
1  0.675916  0.990436
2  1.036234 -0.256323
3  0.482995  1.253826

In [85]:
df.loc['G1'].loc[2] # can be chained depending on index layers

A    1.036234
B   -0.256323
Name: 2, dtype: float64

In [86]:
df.index.names # find indexes

FrozenList([None, None])

In [87]:
df.index.names = 'Group Num'.split()

In [88]:
df # index names applied

                  A         B
Group Num
G1    1    0.675916  0.990436
      2    1.036234 -0.256323
      3    0.482995  1.253826
G2    4    0.716587 -1.116121
      5   -1.149636 -1.089989
      6   -0.623961  0.078738

In [90]:
df.xs('G1') # better option for selecting rows

            A         B
Num
1    0.675916  0.990436
2    1.036234 -0.256323
3    0.482995  1.253826

In [92]:
df.xs(('G1', 1))

A    0.675916
B    0.990436
Name: (G1, 1), dtype: float64

In [93]:
df.xs(('G1', 1))['B']

0.9904363622176005

In [94]:
df.xs(2, level='Num') # another style

              A         B
Group
G1     1.036234 -0.256323

# **Great Job!**